{"pageProps":{"id":["education","undergraduate"],"pageTitle":"undergraduate","pageData":{"contentHtml":"\n## Undergraduate\n\n\n<br/>\n<br/>\n<br/>\n<br/>\n\n\n<div>\n\n![@{\"float\":\"right\",\"margin\":\"20px\",\"marginBottom\":\"100px\"}](https://cs.pub.ro/images/HistoryPeople/Undergraduate4.jpg)\n\n</div>\n\nThe Bachelor studies are meant to form the students as specialists with high professional performances skills, innovation abilities and the capacity to adapt in an ever-changing domain.\n\nThe first contact with the future profession is made from the perspective of a user: students learn how to operate a computer and how to program it. Then, their trainings form the skills to algorithmically solving problems such as: the design, verification accuracy, evaluation of the complexity and increasing the performance through parallelization and distribution. The theory helps to prove that an algorithm is correct or to fixing the limits of its theoretical complexity. The studied languages allow the implementation of hardware or software algorithms.\n\nFurthermore, students get to know the architecture and the main parts of the computers, including hardware components, the operating system, communication protocols, networks, databases and graphics. The training is based on theoretical courses such as Formal languages and Systems theory and technical ones such as Software engineering and Computer engineering. Meanwhile, the students expand their knowledge with methods and algorithmic \"pearls\" used to solve complex problems imposed by the construction of computing systems. Learning system aspects (hardware/software components and the relations between them) provides an important asset to our students. Usually, students get to learn and develop small homework on the most relevant topics in the field.\n\nThe next step separates the five training specializations, from which students choose two. Preparation is oriented towards methodologies (models, methods, technologies and tools) that students use when building information objects. Besides specialization courses students may also choose other courses, creating a custom personalized curriculum.\n\nThe curriculum is similar to programs from other universities, American or European. The specialization training is prefaced by the study of fundamental disciplines (mathematics, physics), common to the electrical or computer profile (logic design, electronics). The plan of study is updated periodically, as required by the continuous changes appearing in the domain of computers and information technology.","style":{"padding":"10px"},"nav":true,"navName":"education"}},"__N_SSG":true}